configuration.org
#+TITLE: GIOS CONFIG


* Intro

Ciao!  This is my configuration file literate written in org-mode. One day I will clear it up In promise.

* Set personal information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Giovanni Calzolari"
	user-mail-address "giovannicalzolari@outlook.com"
	calendar-latitude 59.3
	calendar-longitude 18.1
	calendar-location-name "Stockholm, SE")
#+END_SRC
* First settings

** 1
- don't show the set up window when we open emacs
- don't show the tool bar menu
- instead of asking yes or no, ask y or n
- f5 to revert the buffer
- set mu4e to f4
- set replace-string to f3
- C-x 2 and C-x 3 this time moves the cursor on the other
  tab already
- put the back up file in directory ~/.saves ciao
- swap windows 
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
  (tool-bar-mode -1)
  (fset 'yes-or-no-p 'y-or-n-p)
  (global-set-key (kbd "<f5>") 'revert-buffer)
  (global-set-key (kbd "<f4>") 'mu4e)
  (global-set-key (kbd "<f3>") 'replace-string)
  (global-set-key "\C-x2" (lambda () (interactive)(split-window-vertically) (other-window 1)))
  (global-set-key "\C-x3" (lambda () (interactive)(split-window-horizontally) (other-window 1)))

  (set-face-attribute 'default nil :height 140)
  (setq backup-directory-alist `(("." . "~/.saves")))

  (defun swap-buffer ()
    (interactive)
    (cond ((one-window-p) (display-buffer (other-buffer)))
          ((let* ((buffer-a (current-buffer))
                  (window-b (cadr (window-list)))
                  (buffer-b (window-buffer window-b)))
             (set-window-buffer window-b buffer-a)
             (switch-to-buffer buffer-b)
             (other-window 1)))))
  (global-set-key "\C-x7" (lambda () (interactive)(swap-buffer)))
#+END_SRC 

- display battery when full screen
- don't display the menu bar, nor scroll bar
- don't display title bar but then you can't resize

#+begin_src emacs-lisp
  (display-battery-mode t)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src
** packages
- Load the packages from Melpa
- Install the package use-package, to easily install packages
- Install the package try, to try packages
- Install the package which-key, to help 
- Flex matching to have completion when you look for a new file
  Note: no longer needed because of swiper!
- winner mode to remember windows position with C-c <left> or <right>
- ace-window to switch through multiple windows easily with C-x o

#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)

(require 'package)
  (setq package-enable-at-startup nil)
  (add-to-list 'package-archives
	       '("melpa" . "https://melpa.org/packages/") t)
  ;; (package-initialize)
#+end_src
#+begin_src emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)
  (add-to-list 'package-archives
	       '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  ;; (package-initialize)

  ;; Bootstrap `use-package'
  (unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

  (use-package try
  :ensure t)
  (setq package-check-signature nil)

  (use-package which-key
  :ensure t
  :config
  (which-key-mode))

;  (setq ido-enable-flex-matching t)
;  (setq ido-everywhere t)
;  (ido-mode 1)

  (winner-mode 1)

  (use-package ace-window
    :ensure t
    :init
    (progn
      (global-set-key [remap other-window] 'ace-window)
      (custom-set-faces
       '(aw-leading-char-face
	 ((t (:inherit ace-jump-face-foreground :height 3.0)))))
      ))
  

#+end_src

