configuration.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-12 mån 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GIOS CONFIG</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Giovanni Calzolari" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">GIOS CONFIG</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd7fbf2b">1. Intro</a></li>
<li><a href="#org24d04ba">2. Set personal information</a></li>
<li><a href="#org8cb1fa1">3. First settings</a></li>
<li><a href="#org8dc1414">4. Fly-check</a></li>
<li><a href="#org31f766a">5. Kivy</a></li>
<li><a href="#org9aa1a5a">6. buffer stuff</a></li>
<li><a href="#org9e4c6a7">7. Mu4e email</a></li>
<li><a href="#orgb637dce">8. Python</a></li>
<li><a href="#orga43d3ae">9. Misc Packages</a></li>
<li><a href="#org1c87583">10. OB-translate</a></li>
<li><a href="#org6faa6aa">11. Hydra</a></li>
<li><a href="#org90cf791">12. Electric Pair</a></li>
<li><a href="#org74eaf87">13. Git</a></li>
<li><a href="#orgde4a066">14. Web mode</a></li>
<li><a href="#org8a87885">15. org-mode configuration</a></li>
<li><a href="#org6a86ae6">16. eshell</a></li>
<li><a href="#org7a50e5a">17. Music</a></li>
<li><a href="#org5ffa9c1">18. Pass</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd7fbf2b" class="outline-2">
<h2 id="orgd7fbf2b"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
Ciao!  This is my configuration file literate written in org-mode. One day I will clear it up In promise.
</p>
</div>
</div>

<div id="outline-container-org24d04ba" class="outline-2">
<h2 id="org24d04ba"><span class="section-number-2">2</span> Set personal information</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> user-full-name <span style="color: #7fffd4; font-style: italic;">"Giovanni Calzolari"</span>
      user-mail-address <span style="color: #7fffd4; font-style: italic;">"giovannicalzolari@outlook.com"</span>
      calendar-latitude 59.3
      calendar-longitude 18.1
      calendar-location-name <span style="color: #7fffd4; font-style: italic;">"Stockholm, SE"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8cb1fa1" class="outline-2">
<h2 id="org8cb1fa1"><span class="section-number-2">3</span> First settings</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4fa1cbd" class="outline-3">
<h3 id="org4fa1cbd"><span class="section-number-3">3.1</span> 1</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>don't show the set up window when we open emacs</li>
<li>don't show the tool bar menu</li>
<li>instead of asking yes or no, ask y or n</li>
<li>f5 to revert the buffer</li>
<li>set mu4e to f4</li>
<li>set replace-string to f3</li>
<li>C-x 2 and C-x 3 this time moves the cursor on the other
tab already</li>
<li>put the back up file in directory ~/.saves ciao</li>
<li>swap windows</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> inhibit-startup-message t)
(tool-bar-mode -1)
(fset 'yes-or-no-p 'y-or-n-p)
(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"&lt;f5&gt;"</span>) 'revert-buffer)
(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"&lt;f4&gt;"</span>) 'mu4e)
(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"&lt;f3&gt;"</span>) 'replace-string)
(global-set-key <span style="color: #7fffd4; font-style: italic;">"\C-x2"</span> (<span style="color: #00ffff; font-weight: bold;">lambda</span> () (<span style="color: #00ffff; font-weight: bold;">interactive</span>)(split-window-vertically) (other-window 1)))
(global-set-key <span style="color: #7fffd4; font-style: italic;">"\C-x3"</span> (<span style="color: #00ffff; font-weight: bold;">lambda</span> () (<span style="color: #00ffff; font-weight: bold;">interactive</span>)(split-window-horizontally) (other-window 1)))

(set-face-attribute 'default nil <span style="color: #b0c4de; font-weight: bold;">:height</span> 140)
(<span style="color: #00ffff; font-weight: bold;">setq</span> backup-directory-alist `((<span style="color: #7fffd4; font-style: italic;">"."</span> . <span style="color: #7fffd4; font-style: italic;">"~/.saves"</span>)))

(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">swap-buffer</span> ()
  (<span style="color: #00ffff; font-weight: bold;">interactive</span>)
  (<span style="color: #00ffff; font-weight: bold;">cond</span> ((one-window-p) (display-buffer (other-buffer)))
        ((<span style="color: #00ffff; font-weight: bold;">let*</span> ((buffer-a (current-buffer))
                (window-b (cadr (window-list)))
                (buffer-b (window-buffer window-b)))
           (set-window-buffer window-b buffer-a)
           (switch-to-buffer buffer-b)
           (other-window 1)))))
(global-set-key <span style="color: #7fffd4; font-style: italic;">"\C-x7"</span> (<span style="color: #00ffff; font-weight: bold;">lambda</span> () (<span style="color: #00ffff; font-weight: bold;">interactive</span>)(swap-buffer)))
</pre>
</div>

<ul class="org-ul">
<li>display battery when full screen</li>
<li>don't display the menu bar, nor scroll bar</li>
<li>don't display title bar but then you can't resize</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(display-battery-mode t)
(menu-bar-mode -1)
(scroll-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org176feae" class="outline-3">
<h3 id="org176feae"><span class="section-number-3">3.2</span> packages</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Load the packages from Melpa</li>
<li>Install the package use-package, to easily install packages</li>
<li>Install the package try, to try packages</li>
<li>Install the package which-key, to help</li>
<li>Flex matching to have completion when you look for a new file
Note: no longer needed because of swiper!</li>
<li>winner mode to remember windows position with C-c &lt;left&gt; or &lt;right&gt;</li>
<li>ace-window to switch through multiple windows easily with C-x o</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">package</span>)
(add-to-list 'package-archives '(<span style="color: #7fffd4; font-style: italic;">"org"</span> . <span style="color: #7fffd4; font-style: italic;">"https://orgmode.org/elpa/"</span>) t)

(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">package</span>)
  (<span style="color: #00ffff; font-weight: bold;">setq</span> package-enable-at-startup nil)
  (add-to-list 'package-archives
               '(<span style="color: #7fffd4; font-style: italic;">"melpa"</span> . <span style="color: #7fffd4; font-style: italic;">"https://melpa.org/packages/"</span>) t)
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(package-initialize)</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">package</span>)
  (<span style="color: #00ffff; font-weight: bold;">setq</span> package-enable-at-startup nil)
  (add-to-list 'package-archives
               '(<span style="color: #7fffd4; font-style: italic;">"melpa-stable"</span> . <span style="color: #7fffd4; font-style: italic;">"https://stable.melpa.org/packages/"</span>) t)
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(package-initialize)</span>

  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">Bootstrap `</span><span style="color: #7fffd4; font-weight: bold; font-style: italic;">use-package</span><span style="color: #66cdaa; font-style: italic;">'</span>
  (<span style="color: #00ffff; font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

  (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">try</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
  (<span style="color: #00ffff; font-weight: bold;">setq</span> package-check-signature nil)

  (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">which-key</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (which-key-mode))

<span style="color: #66cdaa; font-style: italic;">;  </span><span style="color: #66cdaa; font-style: italic;">(setq ido-enable-flex-matching t)</span>
<span style="color: #66cdaa; font-style: italic;">;  </span><span style="color: #66cdaa; font-style: italic;">(setq ido-everywhere t)</span>
<span style="color: #66cdaa; font-style: italic;">;  </span><span style="color: #66cdaa; font-style: italic;">(ido-mode 1)</span>

  (winner-mode 1)

  (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">ace-window</span>
    <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
    <span style="color: #b0c4de; font-weight: bold;">:init</span>
    (<span style="color: #00ffff; font-weight: bold;">progn</span>
      (global-set-key [remap other-window] 'ace-window)
      (custom-set-faces
       '(aw-leading-char-face
         ((t (<span style="color: #b0c4de; font-weight: bold;">:inherit</span> ace-jump-face-foreground <span style="color: #b0c4de; font-weight: bold;">:height</span> 3.0)))))
      ))


</pre>
</div>
</div>
</div>
