configuration.org
** Search mode Swiper (and ivy and counsel and avy)!

#+begin_src emacs-lisp
  (use-package ivy
    :ensure t
    :diminish (ivy-mode)
    :bind (("C-x b" . ivy-switch-buffer))
    :config
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-display-style 'fancy))

  (use-package counsel
    :bind
    (("M-y" . counsel-yank-pop)
     :map ivy-minibuffer-map
     ("M-y" . ivy-next-line)))

  (use-package swiper
    :ensure try
    :bind (("C-s" . swiper)
           ("C-r" . swiper)
           ("C-c C-r" . ivy-resume)
           ("M-x" . counsel-M-x)
           ("C-x C-f" . counsel-find-file)
           ("<f1> f" . counsel-describe-function))
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (setq ivy-display-style 'fancy)
      (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
      ))

    (use-package avy
    :ensure t
    :bind ("M-s" . avy-goto-char))

#+end_src

** Auto-completion  

#+begin_src emacs-lisp
  (use-package auto-complete
    :ensure t
    :init
    (progn
      (ac-config-default)
      (global-auto-complete-mode t)
      ))
#+end_src

** Themes

#+begin_src emacs-lisp
  (use-package color-theme-modern
    :ensure t)
#+end_src

#+begin_src emacs-lisp
  (use-package modus-vivendi-theme
    :ensure t)
  (use-package modus-operandi-theme
    :ensure t)
#+end_src

** Reveal.js

#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js

#+begin_src emacs-lisp
    (use-package ox-reveal
      :ensure ox-reveal)
  (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")

  (setq org-reveal-mathjax t)

  (use-package htmlize
    :ensure t)
#+end_src

** Undo tree

#+begin_src emacs-lisp
  (use-package undo-tree
    :ensure t
    :init
    (global-undo-tree-mode))
#+end_src

** Size of minibuffer to 1.1 original one
#+begin_src emacs-lisp
  (add-hook 'minibuffer-setup-hook 'my-minibuffer-setup)
  (defun my-minibuffer-setup ()
    (set (make-local-variable 'face-remapping-alist)
         '((default :height 1.1))))
#+end_src

** Resize windows of buffers

- So basically if you type C-c v it expand current window to use half of the other window's lines
#+begin_src emacs-lisp
  (defun halve-other-window-height ()
    "Expand current window to use half of the other window's lines."
    (interactive)
    (enlarge-window (/ (window-height (next-window)) 2)))
  (global-set-key (kbd "C-c v") 'halve-other-window-height)

#+end_src

** Minimize window bounded

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c C-x m") 'minimize-window)
#+end_src

** Mode bar

#+begin_src emacs-lisp

  (use-package smart-mode-line
    :ensure t

    :init
    (setq sml/no-confirm-load-theme t)
    (setq sml/theme 'dark)

    :config
    (sml/setup))
#+end_src

** Visual line mode and HL line and line spacing

- Basically when you go to the next line you don't
  see the ugly arrow, (exceptin mu4e which
  otherwise fucks up the system)
- Also hl line, it's an horizontal line where you
  are which can be comfortable with this super
  subtle RoyalBlue4, you basically don't see it,
  but you see it ;)
- Also make disappear the window line separator
- Also set a slightly higher line spacingx
#+begin_src emacs-lisp
    (add-hook 'text-mode-hook #'visual-line-mode)


    (global-hl-line-mode t)
    (set-face-background hl-line-face "#1f3550")

    (set-face-attribute 'vertical-border nil)
    (set-face-attribute 'vertical-border  nil :foreground "#282a2e")
  (setq-default line-spacing 0.08)
#+end_src

* Fly-check

#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :init
    (global-flycheck-mode t))
#+end_src

* Kivy

#+begin_src emacs-lisp
  (use-package kivy-mode
    :ensure t)

#+end_src

