configuration.html

<div id="outline-container-org450490f" class="outline-3">
<h3 id="org450490f"><span class="section-number-3">3.3</span> Search mode Swiper (and ivy and counsel and avy)!</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">ivy</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:diminish</span> (ivy-mode)
  <span style="color: #b0c4de; font-weight: bold;">:bind</span> ((<span style="color: #7fffd4; font-style: italic;">"C-x b"</span> . ivy-switch-buffer))
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (ivy-mode 1)
  (<span style="color: #00ffff; font-weight: bold;">setq</span> ivy-use-virtual-buffers t)
  (<span style="color: #00ffff; font-weight: bold;">setq</span> ivy-display-style 'fancy))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">counsel</span>
  <span style="color: #b0c4de; font-weight: bold;">:bind</span>
  ((<span style="color: #7fffd4; font-style: italic;">"M-y"</span> . counsel-yank-pop)
   <span style="color: #b0c4de; font-weight: bold;">:map</span> ivy-minibuffer-map
   (<span style="color: #7fffd4; font-style: italic;">"M-y"</span> . ivy-next-line)))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">swiper</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> try
  <span style="color: #b0c4de; font-weight: bold;">:bind</span> ((<span style="color: #7fffd4; font-style: italic;">"C-s"</span> . swiper)
         (<span style="color: #7fffd4; font-style: italic;">"C-r"</span> . swiper)
         (<span style="color: #7fffd4; font-style: italic;">"C-c C-r"</span> . ivy-resume)
         (<span style="color: #7fffd4; font-style: italic;">"M-x"</span> . counsel-M-x)
         (<span style="color: #7fffd4; font-style: italic;">"C-x C-f"</span> . counsel-find-file)
         (<span style="color: #7fffd4; font-style: italic;">"&lt;f1&gt; f"</span> . counsel-describe-function))
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (<span style="color: #00ffff; font-weight: bold;">progn</span>
    (ivy-mode 1)
    (<span style="color: #00ffff; font-weight: bold;">setq</span> ivy-use-virtual-buffers t)
    (<span style="color: #00ffff; font-weight: bold;">setq</span> ivy-display-style 'fancy)
    (define-key read-expression-map (kbd <span style="color: #7fffd4; font-style: italic;">"C-r"</span>) 'counsel-expression-history)
    ))

  (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">avy</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:bind</span> (<span style="color: #7fffd4; font-style: italic;">"M-s"</span> . avy-goto-char))

</pre>
</div>
</div>
</div>

<div id="outline-container-org3ba4b96" class="outline-3">
<h3 id="org3ba4b96"><span class="section-number-3">3.4</span> Auto-completion</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">auto-complete</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (<span style="color: #00ffff; font-weight: bold;">progn</span>
    (ac-config-default)
    (global-auto-complete-mode t)
    ))
</pre>
</div>
</div>
</div>

<div id="outline-container-org13989d7" class="outline-3">
<h3 id="org13989d7"><span class="section-number-3">3.5</span> Themes</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">color-theme-modern</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">modus-vivendi-theme</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">modus-operandi-theme</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org27cda25" class="outline-3">
<h3 id="org27cda25"><span class="section-number-3">3.6</span> Reveal.js</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">ox-reveal</span>
    <span style="color: #b0c4de; font-weight: bold;">:ensure</span> ox-reveal)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-reveal-root <span style="color: #7fffd4; font-style: italic;">"https://cdn.jsdelivr.net/npm/reveal.js"</span>)

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-reveal-mathjax t)

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">htmlize</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d05a16" class="outline-3">
<h3 id="org1d05a16"><span class="section-number-3">3.7</span> Undo tree</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">undo-tree</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (global-undo-tree-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org63d0c62" class="outline-3">
<h3 id="org63d0c62"><span class="section-number-3">3.8</span> Size of minibuffer to 1.1 original one</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'minibuffer-setup-hook 'my-minibuffer-setup)
(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">my-minibuffer-setup</span> ()
  (set (make-local-variable 'face-remapping-alist)
       '((default <span style="color: #b0c4de; font-weight: bold;">:height</span> 1.1))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org85617b4" class="outline-3">
<h3 id="org85617b4"><span class="section-number-3">3.9</span> Resize windows of buffers</h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li>So basically if you type C-c v it expand current window to use half of the other window's lines</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">halve-other-window-height</span> ()
  <span style="font-weight: bold;">"Expand current window to use half of the other window's lines."</span>
  (<span style="color: #00ffff; font-weight: bold;">interactive</span>)
  (enlarge-window (/ (window-height (next-window)) 2)))
(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-c v"</span>) 'halve-other-window-height)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd476d1" class="outline-3">
<h3 id="orgbd476d1"><span class="section-number-3">3.10</span> Minimize window bounded</h3>
<div class="outline-text-3" id="text-3-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-c C-x m"</span>) 'minimize-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org751876c" class="outline-3">
<h3 id="org751876c"><span class="section-number-3">3.11</span> Mode bar</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">smart-mode-line</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t

  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (<span style="color: #00ffff; font-weight: bold;">setq</span> sml/no-confirm-load-theme t)
  (<span style="color: #00ffff; font-weight: bold;">setq</span> sml/theme 'dark)

  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (sml/setup))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga13de02" class="outline-3">
<h3 id="orga13de02"><span class="section-number-3">3.12</span> Visual line mode and HL line and line spacing</h3>
<div class="outline-text-3" id="text-3-12">
<ul class="org-ul">
<li>Basically when you go to the next line you don't
see the ugly arrow, (exceptin mu4e which
otherwise fucks up the system)</li>
<li>Also hl line, it's an horizontal line where you
are which can be comfortable with this super
subtle RoyalBlue4, you basically don't see it,
but you see it ;)</li>
<li>Also make disappear the window line separator</li>
<li>Also set a slightly higher line spacingx</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (add-hook 'text-mode-hook #'visual-line-mode)


  (global-hl-line-mode t)
  (set-face-background hl-line-face <span style="color: #7fffd4; font-style: italic;">"#1f3550"</span>)

  (set-face-attribute 'vertical-border nil)
  (set-face-attribute 'vertical-border  nil <span style="color: #b0c4de; font-weight: bold;">:foreground</span> <span style="color: #7fffd4; font-style: italic;">"#282a2e"</span>)
(<span style="color: #00ffff; font-weight: bold;">setq-default</span> line-spacing 0.08)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8dc1414" class="outline-2">
<h2 id="org8dc1414"><span class="section-number-2">4</span> Fly-check</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">flycheck</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (global-flycheck-mode t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org31f766a" class="outline-2">
<h2 id="org31f766a"><span class="section-number-2">5</span> Kivy</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">kivy-mode</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)

</pre>
</div>
</div>
</div>
