configuration.html

<div id="outline-container-org9aa1a5a" class="outline-2">
<h2 id="org9aa1a5a"><span class="section-number-2">6</span> buffer stuff</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">bufler</span> <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">mz/bufler</span> (<span style="color: #98fb98; font-weight: bold;">&amp;optional</span> force-refresh)
  (<span style="color: #00ffff; font-weight: bold;">interactive</span> <span style="color: #7fffd4; font-style: italic;">"P"</span>)
  (bufler-list)
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(delete-other-windows)</span>

)

(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-x C-b"</span>) 'mz/bufler)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-x C-b"</span>) 'ibuffer)
(<span style="color: #00ffff; font-weight: bold;">setq</span> ibuffer-saved-filter-groups
      (<span style="color: #00ffff; font-weight: bold;">quote</span> ((<span style="color: #7fffd4; font-style: italic;">"default"</span>
               (<span style="color: #7fffd4; font-style: italic;">"dired"</span> (mode . dired-mode))
               (<span style="color: #7fffd4; font-style: italic;">"org"</span> (name . <span style="color: #7fffd4; font-style: italic;">"^.*org$"</span>))
               (<span style="color: #7fffd4; font-style: italic;">"magit"</span> (mode . magit-mode))
               (<span style="color: #7fffd4; font-style: italic;">"IRC"</span> (<span style="color: #00ffff; font-weight: bold;">or</span> (mode . circe-channel-mode) (mode . circe-server-mode)))
               (<span style="color: #7fffd4; font-style: italic;">"web"</span> (<span style="color: #00ffff; font-weight: bold;">or</span> (mode . web-mode) (mode . js2-mode)))
               (<span style="color: #7fffd4; font-style: italic;">"shell"</span> (<span style="color: #00ffff; font-weight: bold;">or</span> (mode . eshell-mode) (mode . shell-mode)))
               (<span style="color: #7fffd4; font-style: italic;">"mu4e"</span> (<span style="color: #00ffff; font-weight: bold;">or</span>

                        (mode . mu4e-compose-mode)
                        (name . <span style="color: #7fffd4; font-style: italic;">"</span><span style="color: #fa8072; font-weight: bold; font-style: italic;">\</span><span style="color: #7fffd4; font-style: italic;">*mu4e</span><span style="color: #fa8072; font-weight: bold; font-style: italic;">\</span><span style="color: #7fffd4; font-style: italic;">*"</span>)
                        ))
               (<span style="color: #7fffd4; font-style: italic;">"programming"</span> (<span style="color: #00ffff; font-weight: bold;">or</span>
                               (mode . clojure-mode)
                               (mode . clojurescript-mode)
                               (mode . python-mode)
                               (mode . c++-mode)))
               (<span style="color: #7fffd4; font-style: italic;">"emacs"</span> (<span style="color: #00ffff; font-weight: bold;">or</span>
                         (name . <span style="color: #7fffd4; font-style: italic;">"^\\*scratch\\*$"</span>)
                         (name . <span style="color: #7fffd4; font-style: italic;">"^\\*Messages\\*$"</span>)))
               ))))
(add-hook 'ibuffer-mode-hook
          (<span style="color: #00ffff; font-weight: bold;">lambda</span> ()
            (ibuffer-auto-mode 1)
            (ibuffer-switch-to-saved-filter-groups <span style="color: #7fffd4; font-style: italic;">"default"</span>)))

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">don't show these</span>
<span style="color: #66cdaa; font-style: italic;">;;</span><span style="color: #66cdaa; font-style: italic;">(add-to-list 'ibuffer-never-show-predicates "zowie")</span>
<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">Don't show filter groups if there are no buffers in that group</span>
(<span style="color: #00ffff; font-weight: bold;">setq</span> ibuffer-show-empty-filter-groups nil)

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">Don't ask for confirmation to delete marked buffers</span>
(<span style="color: #00ffff; font-weight: bold;">setq</span> ibuffer-expert t)

</pre>
</div>
</div>
</div>
