configuration.org
* Mu4e email

#+begin_src emacs-lisp
  (add-to-list 'load-path "/home/aerogio/email/mu-1.4.10/mu4e/")
  (require 'mu4e)
  (require 'smtpmail)
#+end_src

- settings

#+begin_src emacs-lisp
  (setq message-send-mail-function 'smtpmail-send-it
        starttls-use-gnutls t
        mu4e-sent-messages-behavior 'sent
        mu4e-sent-folder "/Sent"
        mu4e-drafts-folder "/Drafts"
        user-mail-address "giovannicalzolari@outlook.com"
        user-full-name "Giovanni Calzolari"
        smtpmail-default-smtp-server "outlook.office365.com"
        smtpmail-local-domain "outGio.outlook"
        smtpmail-smtp-user "giovannicalzolari@outlook.com"
        smtpmail-smtp-server "smtp.office365.com"
        smtpmail-stream-type 'starttls
        smtpmail-smtp-service 587)

  (setq mu4e-maildir "~/email/"
        mu4e-trash-folder "/Deleted"
        mu4e-refile-folder "/Archive"
        mu4e-get-mail-command "mbsync -a"
        mu4e-update-interval 300 ;; second
        mu4e-compose-signature-auto-include nil
        mu4e-view-show-images t
        mu4e-view-show-addresses t
        mu4e-attachment-dir "~/Dropbox"
        ;;mu4e-use-fancy-chars t
        )

#+end_src

- shortcuts

#+begin_src emacs-lisp
  (setq mu4e-maildir-shortcuts
        '(
          ("/Inbox" . ?g)
          ("/Archive" . ?G)
          ("/Sent" . ?s)
          ))
#+end_src

- bookmarks

#+begin_src emacs-lisp
  (setq mu4e-bookmarks
        `(
          ("flag:unread AND NOT flag:trashed" "Unread messages" ?u)
          ("flag:unread" "Unread messages" ?n)
          ("date:today..now" "Today's messages" ?t)
          ("date:7d..now" "Last 7 days" ?w)
          ("mime:image/*" "Messages with images" ?p)
          (,(mapconcat 'identity
                       (mapcar
                        (lambda (maildir)
                          (concat "maildir:" (car maildir)))
                        mu4e-maildir-shortcuts) " OR ")
           "All inboxes" ?i)))
#+end_src

- mu4e and org-mode
#+begin_src emacs-lisp
  (require 'org-mu4e)
  (setq org-mu4e-convert-to-html t)

  ;;(add-to-list 'load-path "/home/zamansky/Dropbox/opt/org-mode/contrib/lisp")
  ;;(require 'org-mime)

  ;; this seems to fix the babel file saving thing
  (defun org~mu4e-mime-replace-images (str current-file)
    "Replace images in html files with cid links."
    (let (html-images)
      (cons
       (replace-regexp-in-string ;; replace images in html
        "src=\"\\([^\"]+\\)\""
        (lambda (text)
          (format
           "src=\"./:%s\""
           (let* ((url (and (string-match "src=\"\\([^\"]+\\)\"" text)
                            (match-string 1 text)))
                  (path (expand-file-name
                         url (file-name-directory current-file)))
                  (ext (file-name-extension path))
                  (id (replace-regexp-in-string "[\/\\\\]" "_" path)))
             (add-to-list 'html-images
                          (org~mu4e-mime-file
                           (concat "image/" ext) path id))
             id)))
        str)
       html-images)))

  (add-to-list 'mu4e-view-actions
               '("ViewInBrowser" . mu4e-action-view-in-browser) t)
#+end_src
* Python

** which python?

#+begin_src emacs-lisp
  (setq python-shell-interpreter "/home/aerogio/anaconda3/bin/python")
#+end_src

** Elpy

#+begin_src emacs-lisp
  (use-package elpy
    :ensure t
    :init
    (elpy-enable))

  (setq elpy-shell-echo-input nil)
#+end_src
** Jedi

#+begin_src emacs-lisp
  (use-package jedi
    :ensure t
    :init
    (add-hook 'python-mode-hook 'jedi:setup)
    (add-hook 'python-mode-hook 'jedi:ac-setup))
#+end_src
** Yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :init
    (yas-global-mode 1))
#+end_src
** virtualenvwrapper

#+begin_src emacs-lisp
  (use-package virtualenvwrapper
    :ensure t
    :config
    (venv-initialize-interactive-shells)
    (venv-initialize-eshell))
#+end_src
