configuration.html

<div id="outline-container-org9e4c6a7" class="outline-2">
<h2 id="org9e4c6a7"><span class="section-number-2">7</span> Mu4e email</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #7fffd4; font-style: italic;">"/home/aerogio/email/mu-1.4.10/mu4e/"</span>)
(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">mu4e</span>)
(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">smtpmail</span>)
</pre>
</div>

<ul class="org-ul">
<li>settings</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> message-send-mail-function 'smtpmail-send-it
      starttls-use-gnutls t
      mu4e-sent-messages-behavior 'sent
      mu4e-sent-folder <span style="color: #7fffd4; font-style: italic;">"/Sent"</span>
      mu4e-drafts-folder <span style="color: #7fffd4; font-style: italic;">"/Drafts"</span>
      user-mail-address <span style="color: #7fffd4; font-style: italic;">"giovannicalzolari@outlook.com"</span>
      user-full-name <span style="color: #7fffd4; font-style: italic;">"Giovanni Calzolari"</span>
      smtpmail-default-smtp-server <span style="color: #7fffd4; font-style: italic;">"outlook.office365.com"</span>
      smtpmail-local-domain <span style="color: #7fffd4; font-style: italic;">"outGio.outlook"</span>
      smtpmail-smtp-user <span style="color: #7fffd4; font-style: italic;">"giovannicalzolari@outlook.com"</span>
      smtpmail-smtp-server <span style="color: #7fffd4; font-style: italic;">"smtp.office365.com"</span>
      smtpmail-stream-type 'starttls
      smtpmail-smtp-service 587)

(<span style="color: #00ffff; font-weight: bold;">setq</span> mu4e-maildir <span style="color: #7fffd4; font-style: italic;">"~/email/"</span>
      mu4e-trash-folder <span style="color: #7fffd4; font-style: italic;">"/Deleted"</span>
      mu4e-refile-folder <span style="color: #7fffd4; font-style: italic;">"/Archive"</span>
      mu4e-get-mail-command <span style="color: #7fffd4; font-style: italic;">"mbsync -a"</span>
      mu4e-update-interval 300 <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">second</span>
      mu4e-compose-signature-auto-include nil
      mu4e-view-show-images t
      mu4e-view-show-addresses t
      mu4e-attachment-dir <span style="color: #7fffd4; font-style: italic;">"~/Dropbox"</span>
      <span style="color: #66cdaa; font-style: italic;">;;</span><span style="color: #66cdaa; font-style: italic;">mu4e-use-fancy-chars t</span>
      )

</pre>
</div>

<ul class="org-ul">
<li>shortcuts</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> mu4e-maildir-shortcuts
      '(
        (<span style="color: #7fffd4; font-style: italic;">"/Inbox"</span> . ?g)
        (<span style="color: #7fffd4; font-style: italic;">"/Archive"</span> . ?G)
        (<span style="color: #7fffd4; font-style: italic;">"/Sent"</span> . ?s)
        ))
</pre>
</div>

<ul class="org-ul">
<li>bookmarks</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> mu4e-bookmarks
      `(
        (<span style="color: #7fffd4; font-style: italic;">"flag:unread AND NOT flag:trashed"</span> <span style="color: #7fffd4; font-style: italic;">"Unread messages"</span> ?u)
        (<span style="color: #7fffd4; font-style: italic;">"flag:unread"</span> <span style="color: #7fffd4; font-style: italic;">"Unread messages"</span> ?n)
        (<span style="color: #7fffd4; font-style: italic;">"date:today..now"</span> <span style="color: #7fffd4; font-style: italic;">"Today's messages"</span> ?t)
        (<span style="color: #7fffd4; font-style: italic;">"date:7d..now"</span> <span style="color: #7fffd4; font-style: italic;">"Last 7 days"</span> ?w)
        (<span style="color: #7fffd4; font-style: italic;">"mime:image/*"</span> <span style="color: #7fffd4; font-style: italic;">"Messages with images"</span> ?p)
        (,(mapconcat 'identity
                     (mapcar
                      (<span style="color: #00ffff; font-weight: bold;">lambda</span> (maildir)
                        (concat <span style="color: #7fffd4; font-style: italic;">"maildir:"</span> (car maildir)))
                      mu4e-maildir-shortcuts) <span style="color: #7fffd4; font-style: italic;">" OR "</span>)
         <span style="color: #7fffd4; font-style: italic;">"All inboxes"</span> ?i)))
</pre>
</div>

<ul class="org-ul">
<li>mu4e and org-mode</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">org-mu4e</span>)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-mu4e-convert-to-html t)

<span style="color: #66cdaa; font-style: italic;">;;</span><span style="color: #66cdaa; font-style: italic;">(add-to-list 'load-path "/home/zamansky/Dropbox/opt/org-mode/contrib/lisp")</span>
<span style="color: #66cdaa; font-style: italic;">;;</span><span style="color: #66cdaa; font-style: italic;">(require 'org-mime)</span>

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">this seems to fix the babel file saving thing</span>
(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">org~mu4e-mime-replace-images</span> (str current-file)
  <span style="font-weight: bold;">"Replace images in html files with cid links."</span>
  (<span style="color: #00ffff; font-weight: bold;">let</span> (html-images)
    (cons
     (replace-regexp-in-string <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">replace images in html</span>
      <span style="color: #7fffd4; font-style: italic;">"src=\"</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">\\</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">(</span><span style="color: #7fffd4; font-style: italic;">[</span><span style="color: #7fffd4; font-style: italic;">^</span><span style="color: #7fffd4; font-style: italic;">\"]+</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">\\</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">)</span><span style="color: #7fffd4; font-style: italic;">\""</span>
      (<span style="color: #00ffff; font-weight: bold;">lambda</span> (text)
        (format
         <span style="color: #7fffd4; font-style: italic;">"src=\"./:%s\""</span>
         (<span style="color: #00ffff; font-weight: bold;">let*</span> ((url (<span style="color: #00ffff; font-weight: bold;">and</span> (string-match <span style="color: #7fffd4; font-style: italic;">"src=\"</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">\\</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">(</span><span style="color: #7fffd4; font-style: italic;">[</span><span style="color: #7fffd4; font-style: italic;">^</span><span style="color: #7fffd4; font-style: italic;">\"]+</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">\\</span><span style="color: #00ffff; font-weight: bold; font-style: italic;">)</span><span style="color: #7fffd4; font-style: italic;">\""</span> text)
                          (match-string 1 text)))
                (path (expand-file-name
                       url (file-name-directory current-file)))
                (ext (file-name-extension path))
                (id (replace-regexp-in-string <span style="color: #7fffd4; font-style: italic;">"[</span><span style="color: #fa8072; font-weight: bold; font-style: italic;">\</span><span style="color: #7fffd4; font-style: italic;">/\\\\]"</span> <span style="color: #7fffd4; font-style: italic;">"_"</span> path)))
           (add-to-list 'html-images
                        (org~mu4e-mime-file
                         (concat <span style="color: #7fffd4; font-style: italic;">"image/"</span> ext) path id))
           id)))
      str)
     html-images)))

(add-to-list 'mu4e-view-actions
             '(<span style="color: #7fffd4; font-style: italic;">"ViewInBrowser"</span> . mu4e-action-view-in-browser) t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb637dce" class="outline-2">
<h2 id="orgb637dce"><span class="section-number-2">8</span> Python</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org4cf68e7" class="outline-3">
<h3 id="org4cf68e7"><span class="section-number-3">8.1</span> which python?</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> python-shell-interpreter <span style="color: #7fffd4; font-style: italic;">"/home/aerogio/anaconda3/bin/python"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d184e0" class="outline-3">
<h3 id="org9d184e0"><span class="section-number-3">8.2</span> Elpy</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">elpy</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (elpy-enable))

(<span style="color: #00ffff; font-weight: bold;">setq</span> elpy-shell-echo-input nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d39fc4" class="outline-3">
<h3 id="org8d39fc4"><span class="section-number-3">8.3</span> Jedi</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">jedi</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (add-hook 'python-mode-hook 'jedi:setup)
  (add-hook 'python-mode-hook 'jedi:ac-setup))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfaae256" class="outline-3">
<h3 id="orgfaae256"><span class="section-number-3">8.4</span> Yasnippet</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">yasnippet</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (yas-global-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org92400da" class="outline-3">
<h3 id="org92400da"><span class="section-number-3">8.5</span> virtualenvwrapper</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">virtualenvwrapper</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (venv-initialize-interactive-shells)
  (venv-initialize-eshell))
</pre>
</div>
</div>
</div>
