configuration.org
** Live python

# #+begin_src emacs-lisp
#   (use-package live-py-mode
#     :ensure t)
# 
#   (add-hook 'live-py-mode-hook (lambda ()
#                                  (progn
#                                    (setq-default live-py-version (executable-find "python"))
#                                    (live-py-update-all))))
# 
#   (setq live-py-version "python3")
# #+end_src
* Misc Packages

- HL line highlights the line commented cause I don't like it
- beacon, I don't know sth to see the cursor better
- hungry delete, this to delete all the spaces
- aggressive indent, basically work on the indentation,
  doing it automatically
- expand region


#+begin_src emacs-lisp
   ;; (global-hl-line-mode nil)

  (use-package beacon
    :ensure t
    :config
    (beacon-mode 1)
    )

  (use-package hungry-delete
    :ensure t
    :config
    (global-hungry-delete-mode))

  (use-package aggressive-indent
    :ensure t
    :config
    (global-aggressive-indent-mode 1))

  (add-hook 'kivy-mode
            (lambda ()
              (set (make-local-variable 'global-aggressive-indent-mode) nil)))
  ;; (setq aggressive-indent-excluded-modes
  ;;       (remove 'python-mode aggressive-indent-excluded-modes))

   (use-package expand-region
     :ensure t
     :config
     (global-set-key (kbd "C-=") 'er/expand-region))
#+end_src

- iedit
- multiple cursor (but you need keybindings if you actually
  want it)
- narrow-widen automatically bound to C-x n

#+begin_src emacs-lisp
  (use-package iedit
    :ensure t)

  ;; (use-package multiple-cursors
  ;;   :ensure t)

  (defun narrow-or-widen-dwim (p)
    "If the buffer is narrowed, it widens. Otherwise, it narrows intelligently.
    Intelligently means: region, org-src-block, org-subtree, or defun,
    whichever applies first.
    Narrowing to org-src-block actually calls `org-edit-src-code'.

    With prefix P, don't widen, just narrow even if buffer is already
    narrowed."
    (interactive "P")
    (declare (interactive-only))
    (cond ((and (buffer-narrowed-p) (not p)) (widen))
          ((region-active-p)
           (narrow-to-region (region-beginning) (region-end)))
          ((derived-mode-p 'org-mode)
           ;; `org-edit-src-code' is not a real narrowing command.
           ;; Remove this first conditional if you don't want it.
           (cond ((ignore-errors (org-edit-src-code))
                  (delete-other-windows))
                 ((org-at-block-p)
                  (org-narrow-to-block))
                 (t (org-narrow-to-subtree))))
          (t (narrow-to-defun))))
  (define-key ctl-x-map "n" #'narrow-or-widen-dwim)
#+end_src

- so the first one I'm not sure but
- this is to always automatically load new version of files

#+begin_src emacs-lisp
  (setq save-interprogram-paste-before-kill t)

  (global-auto-revert-mode 1)
  (setq auto-revert-verbose nil)
#+end_src
* OB-translate
#+begin_src emacs-lisp
  (use-package ob-translate
    :ensure t)
#+end_src
* Hydra

what is it? maybe you want it

Imagine that you have bound C-c j and C-c k in
your config. You want to call C-c j and C-c k in
some (arbitrary) sequence. Hydra allows you to:

Bind your functions in a way that pressing C-c
jjkk3j5k is equivalent to pressing C-c j C-c j C-c
k C-c k M-3 C-c j M-5 C-c k. Any key other than j
or k exits this state.

Assign a custom hint to this group of functions,
so that you know immediately after pressing C-c
that you can follow up with j or k.



#+BEGIN_SRC emacs-lisp
(use-package hydra
:ensure t)

#+END_SRC


* Electric Pair

#+begin_src emacs-lisp
(electric-pair-mode 1)
#+end_src

#+begin_src emacs-lisp
(defun electric-pair ()
      "If at end of line, insert character pair without surrounding spaces.
    Otherwise, just insert the typed character."
      (interactive)
      (if (eolp) (let (parens-require-spaces)
(insert-pair)) (self-insert-command 1)))


    (add-hook 'python-mode-hook
              (lambda ()
                (define-key python-mode-map "\"" 'electric-pair)
                (define-key python-mode-map "\"" 'electric-pair)
                (define-key python-mode-map "(" 'electric-pair)
                (define-key python-mode-map "[" 'electric-pair)
                (define-key python-mode-map "{" 'electric-pair)))
#+end_src
