configuration.html
<div id="outline-container-org7556e39" class="outline-3">
<h3 id="org7556e39"><span class="section-number-3">8.6</span> Live python</h3>
<div class="outline-text-3" id="text-8-6">
</div>
</div>
</div>
<div id="outline-container-orga43d3ae" class="outline-2">
<h2 id="orga43d3ae"><span class="section-number-2">9</span> Misc Packages</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>HL line highlights the line commented cause I don't like it</li>
<li>beacon, I don't know sth to see the cursor better</li>
<li>hungry delete, this to delete all the spaces</li>
<li>aggressive indent, basically work on the indentation,
doing it automatically</li>
<li>expand region</li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(global-hl-line-mode nil)</span>

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">beacon</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (beacon-mode 1)
  )

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">hungry-delete</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (global-hungry-delete-mode))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">aggressive-indent</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (global-aggressive-indent-mode 1))

(add-hook 'kivy-mode
          (<span style="color: #00ffff; font-weight: bold;">lambda</span> ()
            (set (make-local-variable 'global-aggressive-indent-mode) nil)))
<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(setq aggressive-indent-excluded-modes</span>
<span style="color: #66cdaa; font-style: italic;">;;       </span><span style="color: #66cdaa; font-style: italic;">(remove 'python-mode aggressive-indent-excluded-modes))</span>

 (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">expand-region</span>
   <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
   <span style="color: #b0c4de; font-weight: bold;">:config</span>
   (global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-="</span>) 'er/expand-region))
</pre>
</div>

<ul class="org-ul">
<li>iedit</li>
<li>multiple cursor (but you need keybindings if you actually
want it)</li>
<li>narrow-widen automatically bound to C-x n</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">iedit</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(use-package multiple-cursors</span>
<span style="color: #66cdaa; font-style: italic;">;;   </span><span style="color: #66cdaa; font-style: italic;">:ensure t)</span>

(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">narrow-or-widen-dwim</span> (p)
  <span style="font-weight: bold;">"If the buffer is narrowed, it widens. Otherwise, it narrows intelligently.</span>
<span style="font-weight: bold;">  Intelligently means: region, org-src-block, org-subtree, or defun,</span>
<span style="font-weight: bold;">  whichever applies first.</span>
<span style="font-weight: bold;">  Narrowing to org-src-block actually calls `</span><span style="color: #7fffd4; font-weight: bold;">org-edit-src-code</span><span style="font-weight: bold;">'.</span>

<span style="font-weight: bold;">  With prefix P, don't widen, just narrow even if buffer is already</span>
<span style="font-weight: bold;">  narrowed."</span>
  (<span style="color: #00ffff; font-weight: bold;">interactive</span> <span style="color: #7fffd4; font-style: italic;">"P"</span>)
  (<span style="color: #00ffff; font-weight: bold;">declare</span> (interactive-only))
  (<span style="color: #00ffff; font-weight: bold;">cond</span> ((<span style="color: #00ffff; font-weight: bold;">and</span> (buffer-narrowed-p) (not p)) (widen))
        ((region-active-p)
         (narrow-to-region (region-beginning) (region-end)))
        ((derived-mode-p 'org-mode)
         <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">`</span><span style="color: #7fffd4; font-weight: bold; font-style: italic;">org-edit-src-code</span><span style="color: #66cdaa; font-style: italic;">' is not a real narrowing command.</span>
         <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">Remove this first conditional if you don't want it.</span>
         (<span style="color: #00ffff; font-weight: bold;">cond</span> ((<span style="color: #00ffff; font-weight: bold;">ignore-errors</span> (org-edit-src-code))
                (delete-other-windows))
               ((org-at-block-p)
                (org-narrow-to-block))
               (t (org-narrow-to-subtree))))
        (t (narrow-to-defun))))
(define-key ctl-x-map <span style="color: #7fffd4; font-style: italic;">"n"</span> #'narrow-or-widen-dwim)
</pre>
</div>

<ul class="org-ul">
<li>so the first one I'm not sure but</li>
<li>this is to always automatically load new version of files</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> save-interprogram-paste-before-kill t)

(global-auto-revert-mode 1)
(<span style="color: #00ffff; font-weight: bold;">setq</span> auto-revert-verbose nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1c87583" class="outline-2">
<h2 id="org1c87583"><span class="section-number-2">10</span> OB-translate</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">ob-translate</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6faa6aa" class="outline-2">
<h2 id="org6faa6aa"><span class="section-number-2">11</span> Hydra</h2>
<div class="outline-text-2" id="text-11">
<p>
what is it? maybe you want it
</p>

<p>
Imagine that you have bound C-c j and C-c k in
your config. You want to call C-c j and C-c k in
some (arbitrary) sequence. Hydra allows you to:
</p>

<p>
Bind your functions in a way that pressing C-c
jjkk3j5k is equivalent to pressing C-c j C-c j C-c
k C-c k M-3 C-c j M-5 C-c k. Any key other than j
or k exits this state.
</p>

<p>
Assign a custom hint to this group of functions,
so that you know immediately after pressing C-c
that you can follow up with j or k.
</p>



<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">hydra</span>
<span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)

</pre>
</div>
</div>
</div>
<div id="outline-container-org90cf791" class="outline-2">
<h2 id="org90cf791"><span class="section-number-2">12</span> Electric Pair</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(electric-pair-mode 1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">electric-pair</span> ()
      <span style="font-weight: bold;">"If at end of line, insert character pair without surrounding spaces.</span>
<span style="font-weight: bold;">    Otherwise, just insert the typed character."</span>
      (<span style="color: #00ffff; font-weight: bold;">interactive</span>)
      (<span style="color: #00ffff; font-weight: bold;">if</span> (eolp) (<span style="color: #00ffff; font-weight: bold;">let</span> (parens-require-spaces)
(insert-pair)) <span style="color: #fa8072; font-weight: bold;">(self-insert-command 1)))</span>


    (add-hook 'python-mode-hook
              (<span style="color: #00ffff; font-weight: bold;">lambda</span> ()
                (define-key python-mode-map <span style="color: #7fffd4; font-style: italic;">"\""</span> 'electric-pair)
                (define-key python-mode-map <span style="color: #7fffd4; font-style: italic;">"\""</span> 'electric-pair)
                (define-key python-mode-map <span style="color: #7fffd4; font-style: italic;">"("</span> 'electric-pair)
                (define-key python-mode-map <span style="color: #7fffd4; font-style: italic;">"["</span> 'electric-pair)
                (define-key python-mode-map <span style="color: #7fffd4; font-style: italic;">"{"</span> 'electric-pair)))
</pre>
</div>
</div>
</div>
