configuration.html
<div id="outline-container-org74eaf87" class="outline-2">
<h2 id="org74eaf87"><span class="section-number-2">13</span> Git</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">magit</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:init</span>
  (<span style="color: #00ffff; font-weight: bold;">progn</span>
    (<span style="color: #00ffff; font-weight: bold;">setq</span> magit-section-initial-visibility-alist
          '((stashes . hide) (untracked . hide) (unpushed . hide)))


    (<span style="color: #00ffff; font-weight: bold;">bind-key</span> <span style="color: #7fffd4; font-style: italic;">"C-x g"</span> 'magit-status)
    ))

(<span style="color: #00ffff; font-weight: bold;">setq</span> magit-status-margin
      '(t <span style="color: #7fffd4; font-style: italic;">"%Y-%m-%d %H:%M "</span> magit-log-margin-width t 18))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">git-timemachine</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  )

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">git-gutter-fringe</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (global-git-gutter-mode))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">smerge-mode</span>
  <span style="color: #b0c4de; font-weight: bold;">:after</span> hydra
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (<span style="color: #00ffff; font-weight: bold;">defhydra</span> unpackaged/smerge-hydra
    (<span style="color: #b0c4de; font-weight: bold;">:color</span> pink <span style="color: #b0c4de; font-weight: bold;">:hint</span> nil <span style="color: #b0c4de; font-weight: bold;">:post</span> (smerge-auto-leave))
    <span style="font-weight: bold;">"</span>
<span style="font-weight: bold;">  ^Move^       ^Keep^               ^Diff^                 ^Other^</span>
<span style="font-weight: bold;">  ^^-----------^^-------------------^^---------------------^^-------</span>
<span style="font-weight: bold;">  _n_ext       _b_ase               _&lt;_: upper/base        _C_ombine</span>
<span style="font-weight: bold;">  _p_rev       _u_pper              _=_: upper/lower       _r_esolve</span>
<span style="font-weight: bold;">  ^^           _l_ower              _&gt;_: base/lower        _k_ill current</span>
<span style="font-weight: bold;">  ^^           _a_ll                _R_efine</span>
<span style="font-weight: bold;">  ^^           _RET_: current       _E_diff</span>
<span style="font-weight: bold;">  "</span>
    (<span style="color: #7fffd4; font-style: italic;">"n"</span> smerge-next)
    (<span style="color: #7fffd4; font-style: italic;">"p"</span> smerge-prev)
    (<span style="color: #7fffd4; font-style: italic;">"b"</span> smerge-keep-base)
    (<span style="color: #7fffd4; font-style: italic;">"u"</span> smerge-keep-upper)
    (<span style="color: #7fffd4; font-style: italic;">"l"</span> smerge-keep-lower)
    (<span style="color: #7fffd4; font-style: italic;">"a"</span> smerge-keep-all)
    (<span style="color: #7fffd4; font-style: italic;">"RET"</span> smerge-keep-current)
    (<span style="color: #7fffd4; font-style: italic;">"\C-m"</span> smerge-keep-current)
    (<span style="color: #7fffd4; font-style: italic;">"&lt;"</span> smerge-diff-base-upper)
    (<span style="color: #7fffd4; font-style: italic;">"="</span> smerge-diff-upper-lower)
    (<span style="color: #7fffd4; font-style: italic;">"&gt;"</span> smerge-diff-base-lower)
    (<span style="color: #7fffd4; font-style: italic;">"R"</span> smerge-refine)
    (<span style="color: #7fffd4; font-style: italic;">"E"</span> smerge-ediff)
    (<span style="color: #7fffd4; font-style: italic;">"C"</span> smerge-combine-with-next)
    (<span style="color: #7fffd4; font-style: italic;">"r"</span> smerge-resolve)
    (<span style="color: #7fffd4; font-style: italic;">"k"</span> smerge-kill-current)
    (<span style="color: #7fffd4; font-style: italic;">"ZZ"</span> (<span style="color: #00ffff; font-weight: bold;">lambda</span> ()
            (<span style="color: #00ffff; font-weight: bold;">interactive</span>)
            (save-buffer)
            (bury-buffer))
     <span style="color: #7fffd4; font-style: italic;">"Save and bury buffer"</span> <span style="color: #b0c4de; font-weight: bold;">:color</span> blue)
    (<span style="color: #7fffd4; font-style: italic;">"q"</span> nil <span style="color: #7fffd4; font-style: italic;">"cancel"</span> <span style="color: #b0c4de; font-weight: bold;">:color</span> blue))
  <span style="color: #b0c4de; font-weight: bold;">:hook</span> (magit-diff-visit-file . (<span style="color: #00ffff; font-weight: bold;">lambda</span> ()
                                   (<span style="color: #00ffff; font-weight: bold;">when</span> smerge-mode
                                     (unpackaged/smerge-hydra/body)))))



(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">forge</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde4a066" class="outline-2">
<h2 id="orgde4a066"><span class="section-number-2">14</span> Web mode</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">web-mode</span>
    <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
    <span style="color: #b0c4de; font-weight: bold;">:config</span>
    (add-to-list 'auto-mode-alist '(<span style="color: #7fffd4; font-style: italic;">"\\.html?\\'"</span> . web-mode))
    (<span style="color: #00ffff; font-weight: bold;">setq</span> web-mode-engines-alist
          '((<span style="color: #7fffd4; font-style: italic;">"django"</span>    . <span style="color: #7fffd4; font-style: italic;">"\\.html\\'"</span>)))
    (<span style="color: #00ffff; font-weight: bold;">setq</span> web-mode-ac-sources-alist
          '((<span style="color: #7fffd4; font-style: italic;">"css"</span> . (ac-source-css-property))
            (<span style="color: #7fffd4; font-style: italic;">"html"</span> . (ac-source-words-in-buffer ac-source-abbrev))))

    (<span style="color: #00ffff; font-weight: bold;">setq</span> web-mode-enable-auto-closing t)
    <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(setq web-mode-enable-auto-pairing t)</span>
    (<span style="color: #00ffff; font-weight: bold;">setq</span> web-mode-enable-auto-quoting t)) <span style="color: #66cdaa; font-style: italic;">; </span><span style="color: #66cdaa; font-style: italic;">this fixes the quote problem I mentioned</span>


<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(defun my-web-mode-hook ()</span>
<span style="color: #66cdaa; font-style: italic;">;;   </span><span style="color: #66cdaa; font-style: italic;">(setq web-mode-enable-auto-pairing nil))</span>

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(add-hook 'web-mode-hook  'my-web-mode-hook)</span>

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(defun sp-web-mode-is-code-context (id action context)</span>
<span style="color: #66cdaa; font-style: italic;">;;   </span><span style="color: #66cdaa; font-style: italic;">(and (eq action 'insert)</span>
<span style="color: #66cdaa; font-style: italic;">;;        </span><span style="color: #66cdaa; font-style: italic;">(not (or (get-text-property (point) 'part-side)</span>
<span style="color: #66cdaa; font-style: italic;">;;                 </span><span style="color: #66cdaa; font-style: italic;">(get-text-property (point) 'block-side)))))</span>

<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(sp-local-pair 'web-mode "&lt;" nil :when '(sp-web-mode-is-code-context))</span>
</pre>
</div>
</div>
</div>
