configuration.org
* org-mode configuration


Here I have my org-mode configuration

- hide leading stars
- Save all the org buffer when you archive it
- put languages
- org-tempo to write shortcut <s tab
- bullets
- Start the calendar on Monday
- special C-a C-e
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((C . t)
     (python . t)
     (shell . t)
     (matlab . t)))
#+end_src
#+BEGIN_SRC emacs-lisp
  (setq org-hide-leading-stars t)

  (setq org-archive-subtree-save-file-p t)

  (advice-add 'org-archive-subtree-default :after 'org-save-all-org-buffers)
  ()

  (require 'org-tempo)

  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  (setq calendar-week-start-day 1)

  (setq org-special-ctrl-a/e t)
  (setq org-html-validation-link nil)
#+END_SRC

- do not truncate lines and enable word wrap

#+begin_src emacs-lisp 
  (set-default 'truncate-lines nil)
  (set-default 'word-wrap t)
  (setq helm-buffers-truncate-lines nil)
  (setq org-startup-truncated nil)
#+end_src

- do not align tags
- Set the symbols for different heading levels
- Load org-pretty tags

#+begin_src emacs-lisp
  (setq org-auto-align-tags nil)
  (setq org-bullets-bullet-list (quote ("◉" "◆" "✚" "☀" "○")))
  (use-package org-pretty-tags
    :ensure t)
#+end_src

- count all checkboxes not just the one directly
  below

#+begin_src emacs-lisp
  (setq org-checkbox-hierarchical-statistics nil)
#+end_src

- there is a way to resize images according to 4
  laws which makes a loot of sense, but I don't
  have to code to do that. Look when you
  have time [[https://sainathadapa.github.io/emacs-spacemacs-config/org-config][Here]]

#+begin_src emacs-lisp
  (setq org-image-actual-width 1800)
#+end_src

- org agenda:
  1. Compact layout
  2. Restore layout after exit from agenda view
  3. Default appointment duration (30 minutes)
  4. Pressing Tab while the cursor is on a task
     will expand that task in a separate buffer
  5. Include these files and directories when
     creating the agenda ( Dropbox /orgfiles )
  6. Don't show tasks in agenda if they are done
  7. Max number of days to show in agenda
  8. Warn about a deadline
  9. Agenda starts on the current day
  10. Sorting strategy
  11. Display format
  12. Default format for columns view
  13. Place tags close to the right-hand side of
      the window. From
      http://lists.gnu.org/archive/html/emacs-orgmode//2010-12/msg00410.html
  14. By default, agenda will reorganize
      frames/splits
  15. By default, Org maintains only a single
      agenda buffer and rebuilds it each time you
      change the view, to make sure everything is
      always up to date. If you often switch
      between agenda views and the build time
      bothers you, you can turn on sticky agenda
      buffers or make this the default by
      customizing the variable
      org-agenda-sticky. With sticky agendas, the
      agenda dispatcher will not recreate agenda
      views from scratch, it will only switch to
      the selected one, and you need to update the
      agenda by hand with r or g when needed. You
      can toggle sticky agenda view any time with
      org-toggle-sticky-agenda.
  16. When you run an agenda command, Org visits
      agenda files that are not yet visited. When
      finding a file for the first time, Org
      checks the startup options and apply them to
      the buffer: those options are either
      globally set through the org-startup-*
      variables or on a per-file basis through the
      #+STARTUP keyword. Especially, Org will
      honor the startup visibility status, as set
      by org-startup-folded or #+STARTUP:
      folded. This may slow down the operation of
      visiting a file very much, and the process
      of selecting agenda entries consequently. To
      prevent agenda commands to honor startup
      options when visiting an agenda file for the
      first time, do this


#+begin_src emacs-lisp
  (setq org-agenda-compact-blocks t)
  (setq org-agenda-restore-windows-after-quit t)
  (setq org-agenda-default-appointment-duration 30)
  (add-hook 'org-agenda-mode-hook
            (lambda () (local-set-key [tab] 'org-agenda-tree-to-indirect-buffer)))
  (setq org-agenda-files '("~/Dropbox/orgfiles"))
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-span 45)
  (setq org-deadline-warning-days 90)
  (setq org-agenda-start-on-weekday nil)

  (setq org-agenda-sorting-strategy
        (quote
         ((agenda priority-down alpha-up)
          (todo priority-down alpha-up)
          (tags priority-down alpha-up))))

  (setq org-agenda-prefix-format
        (quote
         ((agenda . "%s %?-12t %e ")
          (timeline . "  %s")
          (todo . " %i %e ")
          (tags . " %i %e ")
          (search . " %i %e "))))
  (setq org-columns-default-format
        "%75ITEM %TODO %PRIORITY %SCHEDULED %DEADLINE %CLOSED %ALLTAGS")
  (add-hook 'org-finalize-agenda-hook 'place-agenda-tags)
  (defun place-agenda-tags ()
    "Put the agenda tags by the right border of the agenda window."
    (setq org-agenda-tags-column (- 4 (window-width)))
    (org-agenda-align-tags))
  (setq org-agenda-window-setup 'reorganize-frame)
  (setq org-agenda-sticky nil)
  (setq org-agenda-inhibit-startup t)
#+end_src

** CONTINUA QUA

