configuration.html

<div id="outline-container-org8a87885" class="outline-2">
<h2 id="org8a87885"><span class="section-number-2">15</span> org-mode configuration</h2>
<div class="outline-text-2" id="text-15">
<p>
Here I have my org-mode configuration
</p>

<ul class="org-ul">
<li>hide leading stars</li>
<li>Save all the org buffer when you archive it</li>
<li>put languages</li>
<li>org-tempo to write shortcut &lt;s tab</li>
<li>bullets</li>
<li>Start the calendar on Monday</li>
<li>special C-a C-e</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)
   (python . t)
   (shell . t)
   (matlab . t)))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> org-hide-leading-stars t)

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-archive-subtree-save-file-p t)

(advice-add 'org-archive-subtree-default <span style="color: #b0c4de; font-weight: bold;">:after</span> 'org-save-all-org-buffers)
()

(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">org-tempo</span>)

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">org-bullets</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (add-hook 'org-mode-hook (<span style="color: #00ffff; font-weight: bold;">lambda</span> () (org-bullets-mode 1))))

(<span style="color: #00ffff; font-weight: bold;">setq</span> calendar-week-start-day 1)

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-special-ctrl-a/e t)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-html-validation-link nil)
</pre>
</div>

<ul class="org-ul">
<li>do not truncate lines and enable word wrap</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-default 'truncate-lines nil)
(set-default 'word-wrap t)
(<span style="color: #00ffff; font-weight: bold;">setq</span> helm-buffers-truncate-lines nil)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-startup-truncated nil)
</pre>
</div>

<ul class="org-ul">
<li>do not align tags</li>
<li>Set the symbols for different heading levels</li>
<li>Load org-pretty tags</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> org-auto-align-tags nil)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-bullets-bullet-list (<span style="color: #00ffff; font-weight: bold;">quote</span> (<span style="color: #7fffd4; font-style: italic;">"&#9673;"</span> <span style="color: #7fffd4; font-style: italic;">"&#9670;"</span> <span style="color: #7fffd4; font-style: italic;">"&#10010;"</span> <span style="color: #7fffd4; font-style: italic;">"&#9728;"</span> <span style="color: #7fffd4; font-style: italic;">"&#9675;"</span>)))
(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">org-pretty-tags</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)
</pre>
</div>

<ul class="org-ul">
<li>count all checkboxes not just the one directly
below</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> org-checkbox-hierarchical-statistics nil)
</pre>
</div>

<ul class="org-ul">
<li>there is a way to resize images according to 4
laws which makes a loot of sense, but I don't
have to code to do that. Look when you
have time <a href="https://sainathadapa.github.io/emacs-spacemacs-config/org-config">Here</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> org-image-actual-width 1800)
</pre>
</div>

<ul class="org-ul">
<li>org agenda:
<ol class="org-ol">
<li>Compact layout</li>
<li>Restore layout after exit from agenda view</li>
<li>Default appointment duration (30 minutes)</li>
<li>Pressing Tab while the cursor is on a task
will expand that task in a separate buffer</li>
<li>Include these files and directories when
creating the agenda ( Dropbox /orgfiles )</li>
<li>Don't show tasks in agenda if they are done</li>
<li>Max number of days to show in agenda</li>
<li>Warn about a deadline</li>
<li>Agenda starts on the current day</li>
<li>Sorting strategy</li>
<li>Display format</li>
<li>Default format for columns view</li>
<li>Place tags close to the right-hand side of
the window. From
<a href="http://lists.gnu.org/archive/html/emacs-orgmode//2010-12/msg00410.html">http://lists.gnu.org/archive/html/emacs-orgmode//2010-12/msg00410.html</a></li>
<li>By default, agenda will reorganize
frames/splits</li>
<li>By default, Org maintains only a single
agenda buffer and rebuilds it each time you
change the view, to make sure everything is
always up to date. If you often switch
between agenda views and the build time
bothers you, you can turn on sticky agenda
buffers or make this the default by
customizing the variable
org-agenda-sticky. With sticky agendas, the
agenda dispatcher will not recreate agenda
views from scratch, it will only switch to
the selected one, and you need to update the
agenda by hand with r or g when needed. You
can toggle sticky agenda view any time with
org-toggle-sticky-agenda.</li>
<li>When you run an agenda command, Org visits
agenda files that are not yet visited. When
finding a file for the first time, Org
checks the startup options and apply them to
the buffer: those options are either
globally set through the org-startup-*
variables or on a per-file basis through the
#+STARTUP keyword. Especially, Org will
honor the startup visibility status, as set
by org-startup-folded or #+STARTUP:
folded. This may slow down the operation of
visiting a file very much, and the process
of selecting agenda entries consequently. To
prevent agenda commands to honor startup
options when visiting an agenda file for the
first time, do this</li>
</ol></li>
</ul>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-compact-blocks t)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-restore-windows-after-quit t)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-default-appointment-duration 30)
(add-hook 'org-agenda-mode-hook
          (<span style="color: #00ffff; font-weight: bold;">lambda</span> () (local-set-key [tab] 'org-agenda-tree-to-indirect-buffer)))
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-files '(<span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles"</span>))
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-skip-deadline-if-done t)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-skip-scheduled-if-done t)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-span 45)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-deadline-warning-days 90)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-start-on-weekday nil)

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-sorting-strategy
      (<span style="color: #00ffff; font-weight: bold;">quote</span>
       ((agenda priority-down alpha-up)
        (todo priority-down alpha-up)
        (tags priority-down alpha-up))))

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-prefix-format
      (<span style="color: #00ffff; font-weight: bold;">quote</span>
       ((agenda . <span style="color: #7fffd4; font-style: italic;">"%s %?-12t %e "</span>)
        (timeline . <span style="color: #7fffd4; font-style: italic;">"  %s"</span>)
        (todo . <span style="color: #7fffd4; font-style: italic;">" %i %e "</span>)
        (tags . <span style="color: #7fffd4; font-style: italic;">" %i %e "</span>)
        (search . <span style="color: #7fffd4; font-style: italic;">" %i %e "</span>))))
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-columns-default-format
      <span style="color: #7fffd4; font-style: italic;">"%75ITEM %TODO %PRIORITY %SCHEDULED %DEADLINE %CLOSED %ALLTAGS"</span>)
(add-hook 'org-finalize-agenda-hook 'place-agenda-tags)
(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">place-agenda-tags</span> ()
  <span style="font-weight: bold;">"Put the agenda tags by the right border of the agenda window."</span>
  (<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-tags-column (- 4 (window-width)))
  (org-agenda-align-tags))
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-window-setup 'reorganize-frame)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-sticky nil)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-inhibit-startup t)
</pre>
</div>
</div>
