configuration.org
** open emacs agenda automatically

#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  (setq initial-buffer-choice "~/Dropbox/orgfiles/ciao.org")

  (defun my-init-hook ()
    (split-window-right)
    (let ((org-agenda-window-setup 'other-window))
      (org-agenda nil "a")))

  (add-hook 'window-setup-hook #'my-init-hook)

#+end_src


** auto-fill (vai a capo) and auto-completion

#+begin_src emacs-lisp

(auto-fill-mode -1)
(remove-hook 'text-mode-hook #'turn-on-auto-fill)

(add-hook 'org-mode-hook 'turn-off-auto-fill)
(remove-hook 'org-mode-hook #'turn-on-auto-fill)




  ;; (add-hook 'org-mode-hook '(lambda () (setq fill-column 50)))
  ;; (add-hook 'org-mode-hook 'auto-fill-mode)

  ;; (use-package org-ac
  ;;   :ensure t
  ;;   :init (progn
  ;;           (require 'org-ac)
  ;;           (org-ac/config-default)
  ;;           ))
#+end_src

** org-file app & directory & capture & settings
- Remember, you open links with C-c C-o

#+begin_src emacs-lisp
  (setq org-file-apps
        (append '(
                  ("\\.pdf\\'". "evince %s")
                  ) org-file-apps ))

  (global-set-key "\C-ca" 'org-agenda)

  (custom-set-variables
   '(org-directory "~/Dropbox/orgfiles")
   '(org-default-notes-file (concat org-directory "/ciao.org"))
   '(org-export-html-postamble nil)
   ;; '(org-startup-folded (quote overview))
   '(org-startup-folded t)
   '(org-startup-indented t)
   )

  (global-set-key (kbd "C-c c") 'org-capture)

  (setq org-agenda-files (list "~/Dropbox/orgfiles/gcal.org"
                               "~/Dropbox/orgfiles/ciao.org"
                               ))

  (setq org-agenda-custom-commands
        '(("c" "Simple agenda view"
           ((agenda "")
            (alltodo "")))))


  (setq org-capture-templates
        '(("a" "Appointment" entry (file+headline  "~/Dropbox/orgfiles/gcal.org" "Appointments")
           "* TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n")
          ("n" "Note" entry (file+headline "~/Dropbox/orgfiles/ciao.org" "Notes")
           "* NB: %?\n%T")
          ;; ("l" "Link" entry (file+headline "~/Dropbox/orgfiles/ciao.org" "Links")
          ;; "* %?[[%:link][%:description]] %U\n%i\n %^g \n%T" :prepend t)
          ("l" "Link" entry (file+headline "~/Dropbox/orgfiles/ciao.org" "Links")
           "* %? %^L %^g \n%T" :prepend t)
          ("b" "Blog idea" entry (file+headline "~/Dropbox/orgfiles/i.org" "Blog Topics:")
           "* %?\n%T" :prepend t)
          ("t" "To Do Item" entry (file+headline "~/Dropbox/orgfiles/ciao.org" "To Do Items")
           "* TODO %?\n%T" :prepend t)
          ("j" "Journal" entry (file+datetree "~/Dropbox/journal.org")
           "* %?\nEntered on %U\n  %i\n  %a")
          ("s" "Screencast" entry (file "~/Dropbox/orgfiles/screencastnotes.org")
           "* %?\n%i\n")))
#+end_src

- code

#+begin_src emacs-lisp
  (defadvice org-capture-finalize
      (after delete-capture-frame activate)
    "Advise capture-finalize to close the frame"
    (if (equal "capture" (frame-parameter nil 'name))
        (delete-frame)))

  (defadvice org-capture-destroy
      (after delete-capture-frame activate)
    "Advise capture-destroy to close the frame"
    (if (equal "capture" (frame-parameter nil 'name))
        (delete-frame)))

  (use-package noflet
    :ensure t )
  (defun make-capture-frame ()
    "Create a new frame and run org-capture."
    (interactive)
    (make-frame '((name . "capture")))
    (select-frame-by-name "capture")
    (delete-other-windows)
    (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
            (org-capture)))
#+end_src

- Link
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c l") 'org-store-link)
#+end_src

** Encrypt

#+begin_src emacs-lisp
  (require 'org-crypt)
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance (quote ("crypt")))
  ;; GPG key to use for encryption
  ;; Either the Key ID or set to nil to use symmetric encryption.
  (setq org-crypt-key nil)
#+end_src
