configuration.html

<div id="outline-container-orgcca1935" class="outline-3">
<h3 id="orgcca1935"><span class="section-number-3">15.1</span> CONTINUA QUA</h3>
</div>

<div id="outline-container-orgec156ac" class="outline-3">
<h3 id="orgec156ac"><span class="section-number-3">15.2</span> open emacs agenda automatically</h3>
<div class="outline-text-3" id="text-15-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'default-frame-alist '(fullscreen . maximized))
(<span style="color: #00ffff; font-weight: bold;">setq</span> initial-buffer-choice <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/ciao.org"</span>)

(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">my-init-hook</span> ()
  (split-window-right)
  (<span style="color: #00ffff; font-weight: bold;">let</span> ((org-agenda-window-setup 'other-window))
    (org-agenda nil <span style="color: #7fffd4; font-style: italic;">"a"</span>)))

(add-hook 'window-setup-hook #'my-init-hook)

</pre>
</div>
</div>
</div>


<div id="outline-container-org955fa2e" class="outline-3">
<h3 id="org955fa2e"><span class="section-number-3">15.3</span> auto-fill (vai a capo) and auto-completion</h3>
<div class="outline-text-3" id="text-15-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(auto-fill-mode -1)
(remove-hook 'text-mode-hook #'turn-on-auto-fill)

(add-hook 'org-mode-hook 'turn-off-auto-fill)
(remove-hook 'org-mode-hook #'turn-on-auto-fill)




  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(add-hook 'org-mode-hook '(lambda () (setq fill-column 50)))</span>
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(add-hook 'org-mode-hook 'auto-fill-mode)</span>

  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(use-package org-ac</span>
  <span style="color: #66cdaa; font-style: italic;">;;   </span><span style="color: #66cdaa; font-style: italic;">:ensure t</span>
  <span style="color: #66cdaa; font-style: italic;">;;   </span><span style="color: #66cdaa; font-style: italic;">:init (progn</span>
  <span style="color: #66cdaa; font-style: italic;">;;           </span><span style="color: #66cdaa; font-style: italic;">(require 'org-ac)</span>
  <span style="color: #66cdaa; font-style: italic;">;;           </span><span style="color: #66cdaa; font-style: italic;">(org-ac/config-default)</span>
  <span style="color: #66cdaa; font-style: italic;">;;           </span><span style="color: #66cdaa; font-style: italic;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae76726" class="outline-3">
<h3 id="orgae76726"><span class="section-number-3">15.4</span> org-file app &amp; directory &amp; capture &amp; settings</h3>
<div class="outline-text-3" id="text-15-4">
<ul class="org-ul">
<li>Remember, you open links with C-c C-o</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> org-file-apps
      (append '(
                (<span style="color: #7fffd4; font-style: italic;">"\\.pdf\\'"</span>. <span style="color: #7fffd4; font-style: italic;">"evince %s"</span>)
                ) <span style="color: #fa8072; font-weight: bold;">org-file-apps ))</span>

(global-set-key <span style="color: #7fffd4; font-style: italic;">"\C-ca"</span> 'org-agenda)

(custom-set-variables
 '(org-directory <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles"</span>)
 '(org-default-notes-file (concat org-directory <span style="color: #7fffd4; font-style: italic;">"/ciao.org"</span>))
 '(org-export-html-postamble nil)
 <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">'(org-startup-folded (quote overview))</span>
 '(org-startup-folded t)
 '(org-startup-indented t)
 )

(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-c c"</span>) 'org-capture)

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-files (list <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/gcal.org"</span>
                             <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/ciao.org"</span>
                             ))

(<span style="color: #00ffff; font-weight: bold;">setq</span> org-agenda-custom-commands
      '((<span style="color: #7fffd4; font-style: italic;">"c"</span> <span style="color: #7fffd4; font-style: italic;">"Simple agenda view"</span>
         ((agenda <span style="color: #7fffd4; font-style: italic;">""</span>)
          (alltodo <span style="color: #7fffd4; font-style: italic;">""</span>)))))


(<span style="color: #00ffff; font-weight: bold;">setq</span> org-capture-templates
      '((<span style="color: #7fffd4; font-style: italic;">"a"</span> <span style="color: #7fffd4; font-style: italic;">"Appointment"</span> entry (file+headline  <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/gcal.org"</span> <span style="color: #7fffd4; font-style: italic;">"Appointments"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* TODO %?\n:PROPERTIES:\n\n:END:\nDEADLINE: %^T \n %i\n"</span>)
        (<span style="color: #7fffd4; font-style: italic;">"n"</span> <span style="color: #7fffd4; font-style: italic;">"Note"</span> entry (file+headline <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/ciao.org"</span> <span style="color: #7fffd4; font-style: italic;">"Notes"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* NB: %?\n%T"</span>)
        <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">("l" "Link" entry (file+headline "~/Dropbox/orgfiles/ciao.org" "Links")</span>
        <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">"* %?[[%:link][%:description]] %U\n%i\n %^g \n%T" :prepend t)</span>
        (<span style="color: #7fffd4; font-style: italic;">"l"</span> <span style="color: #7fffd4; font-style: italic;">"Link"</span> entry (file+headline <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/ciao.org"</span> <span style="color: #7fffd4; font-style: italic;">"Links"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* %? %^L %^g \n%T"</span> <span style="color: #b0c4de; font-weight: bold;">:prepend</span> t)
        (<span style="color: #7fffd4; font-style: italic;">"b"</span> <span style="color: #7fffd4; font-style: italic;">"Blog idea"</span> entry (file+headline <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/i.org"</span> <span style="color: #7fffd4; font-style: italic;">"Blog Topics:"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* %?\n%T"</span> <span style="color: #b0c4de; font-weight: bold;">:prepend</span> t)
        (<span style="color: #7fffd4; font-style: italic;">"t"</span> <span style="color: #7fffd4; font-style: italic;">"To Do Item"</span> entry (file+headline <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/ciao.org"</span> <span style="color: #7fffd4; font-style: italic;">"To Do Items"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* TODO %?\n%T"</span> <span style="color: #b0c4de; font-weight: bold;">:prepend</span> t)
        (<span style="color: #7fffd4; font-style: italic;">"j"</span> <span style="color: #7fffd4; font-style: italic;">"Journal"</span> entry (file+datetree <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/journal.org"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* %?\nEntered on %U\n  %i\n  %a"</span>)
        (<span style="color: #7fffd4; font-style: italic;">"s"</span> <span style="color: #7fffd4; font-style: italic;">"Screencast"</span> entry (file <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/screencastnotes.org"</span>)
         <span style="color: #7fffd4; font-style: italic;">"* %?\n%i\n"</span>)))
</pre>
</div>

<ul class="org-ul">
<li>code</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">defadvice</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">org-capture-finalize</span>
    (after delete-capture-frame activate)
  <span style="font-weight: bold;">"Advise capture-finalize to close the frame"</span>
  (<span style="color: #00ffff; font-weight: bold;">if</span> (equal <span style="color: #7fffd4; font-style: italic;">"capture"</span> (frame-parameter nil 'name))
      (delete-frame)))

(<span style="color: #00ffff; font-weight: bold;">defadvice</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">org-capture-destroy</span>
    (after delete-capture-frame activate)
  <span style="font-weight: bold;">"Advise capture-destroy to close the frame"</span>
  (<span style="color: #00ffff; font-weight: bold;">if</span> (equal <span style="color: #7fffd4; font-style: italic;">"capture"</span> (frame-parameter nil 'name))
      (delete-frame)))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">noflet</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t )
(<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">make-capture-frame</span> ()
  <span style="font-weight: bold;">"Create a new frame and run org-capture."</span>
  (<span style="color: #00ffff; font-weight: bold;">interactive</span>)
  (make-frame '((name . <span style="color: #7fffd4; font-style: italic;">"capture"</span>)))
  (select-frame-by-name <span style="color: #7fffd4; font-style: italic;">"capture"</span>)
  (delete-other-windows)
  (<span style="color: #00ffff; font-weight: bold;">noflet</span> ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
          (org-capture)))
</pre>
</div>

<ul class="org-ul">
<li>Link</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-c l"</span>) 'org-store-link)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b593ef" class="outline-3">
<h3 id="org0b593ef"><span class="section-number-3">15.5</span> Encrypt</h3>
<div class="outline-text-3" id="text-15-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">org-crypt</span>)
(org-crypt-use-before-save-magic)
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-tags-exclude-from-inheritance (<span style="color: #00ffff; font-weight: bold;">quote</span> (<span style="color: #7fffd4; font-style: italic;">"crypt"</span>)))
<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">GPG key to use for encryption</span>
<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">Either the Key ID or set to nil to use symmetric encryption.</span>
(<span style="color: #00ffff; font-weight: bold;">setq</span> org-crypt-key nil)
</pre>
</div>
</div>
</div>
