configuration.org
** gcal

#+begin_src emacs-lisp
  (setq package-check-signature nil)


  (use-package org-gcal
    :ensure t
    :config
    (setq org-gcal-client-id "54971705536-chq41n98lb4afqu8cvldlgt550vinkkq.apps.googleusercontent.com"
          org-gcal-client-secret "y7dB-yOAZ_DdfaqlSIqoXVSn"
          org-gcal-file-alist '(("giovannicalzolari96@gmail.com" .  "~/Dropbox/orgfiles/gcal.org"))))

  (add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
  ;; (add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))

  (global-set-key (kbd "C-c g") 'org-gcal-post-at-point)
#+end_src

- graphical visualization of the calendar (doesn't work good)

#+begin_src emacs-lisp

  (use-package calfw
    :ensure ;TODO:
    :config
    (require 'calfw)
    ;; (require 'calfw-org)			
    (setq cfw:org-overwrite-default-keybinding t)
    ;; (require 'calfw-ical)
    ;; (require 'calfw-cal)

    (defun mycalendar ()
      (interactive)
      (cfw:open-calendar-buffer
       :contents-sources
       (list
        ;; (cfw:org-create-source "Green")  ; orgmode source
        (cfw:cal-create-source "gcal" "https://somecalnedaraddress" "IndianRed") ; devorah calender
        (cfw:cal-create-source "gcal" "https://anothercalendaraddress" "IndianRed") ; google calendar ICS
        )))
    (setq cfw:org-overwrite-default-keybinding t))

  (use-package calfw-gcal
    :ensure t
    :config
    (require 'calfw-gcal))
#+end_src


** Unfill
#+begin_src emacs-lisp
  (use-package unfill
    :ensure t)

    (define-key global-map "\M-Q" 'unfill-paragraph)
#+end_src
* eshell

#+begin_src emacs-lisp
  
#+end_src 

* Music 

#+begin_src emacs-lisp
  (use-package simple-mpc
    :ensure t)

  (global-set-key (kbd "<f6>") 'simple-mpc)
#+end_src
* Pass


#+begin_src emacs-lisp
  (use-package pass
    :ensure t)

  (global-set-key (kbd "<f7>") 'pass)
#+end_src

* Org-settings: :noexport:


# Local variables:
# after-save-hook: org-html-export-to-html
# end:

#+STARTUP: indent overview
#+options: toc:1 
# #+setupfile: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+attr_html: width="100px"
#+attr_org: :width 100
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
