configuration.html
<div id="outline-container-org25e1dde" class="outline-3">
<h3 id="org25e1dde"><span class="section-number-3">15.6</span> gcal</h3>
<div class="outline-text-3" id="text-15-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">setq</span> package-check-signature nil)


(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">org-gcal</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (<span style="color: #00ffff; font-weight: bold;">setq</span> org-gcal-client-id <span style="color: #7fffd4; font-style: italic;">"54971705536-chq41n98lb4afqu8cvldlgt550vinkkq.apps.googleusercontent.com"</span>
        org-gcal-client-secret <span style="color: #7fffd4; font-style: italic;">"y7dB-yOAZ_DdfaqlSIqoXVSn"</span>
        org-gcal-file-alist '((<span style="color: #7fffd4; font-style: italic;">"giovannicalzolari96@gmail.com"</span> .  <span style="color: #7fffd4; font-style: italic;">"~/Dropbox/orgfiles/gcal.org"</span>))))

(add-hook 'org-agenda-mode-hook (<span style="color: #00ffff; font-weight: bold;">lambda</span> () (org-gcal-sync) ))
<span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))</span>

(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"C-c g"</span>) 'org-gcal-post-at-point)
</pre>
</div>

<ul class="org-ul">
<li>graphical visualization of the calendar (doesn't work good)</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">calfw</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> <span style="color: #66cdaa; font-style: italic;">;</span><span style="color: #66cdaa; font-style: italic;">TODO:</span>
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">calfw</span>)
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(require 'calfw-org)                       </span>
  (<span style="color: #00ffff; font-weight: bold;">setq</span> cfw:org-overwrite-default-keybinding t)
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(require 'calfw-ical)</span>
  <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(require 'calfw-cal)</span>

  (<span style="color: #00ffff; font-weight: bold;">defun</span> <span style="color: #87cefa; font-weight: bold; font-style: italic;">mycalendar</span> ()
    (<span style="color: #00ffff; font-weight: bold;">interactive</span>)
    (cfw:open-calendar-buffer
     <span style="color: #b0c4de; font-weight: bold;">:contents-sources</span>
     (list
      <span style="color: #66cdaa; font-style: italic;">;; </span><span style="color: #66cdaa; font-style: italic;">(cfw:org-create-source "Green")  ; orgmode source</span>
      (cfw:cal-create-source <span style="color: #7fffd4; font-style: italic;">"gcal"</span> <span style="color: #7fffd4; font-style: italic;">"https://somecalnedaraddress"</span> <span style="color: #7fffd4; font-style: italic;">"IndianRed"</span>) <span style="color: #66cdaa; font-style: italic;">; </span><span style="color: #66cdaa; font-style: italic;">devorah calender</span>
      (cfw:cal-create-source <span style="color: #7fffd4; font-style: italic;">"gcal"</span> <span style="color: #7fffd4; font-style: italic;">"https://anothercalendaraddress"</span> <span style="color: #7fffd4; font-style: italic;">"IndianRed"</span>) <span style="color: #66cdaa; font-style: italic;">; </span><span style="color: #66cdaa; font-style: italic;">google calendar ICS</span>
      )))
  (<span style="color: #00ffff; font-weight: bold;">setq</span> cfw:org-overwrite-default-keybinding t))

(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">calfw-gcal</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t
  <span style="color: #b0c4de; font-weight: bold;">:config</span>
  (<span style="color: #00ffff; font-weight: bold;">require</span> '<span style="color: #7fffd4; font-weight: bold;">calfw-gcal</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-orge5f3715" class="outline-3">
<h3 id="orge5f3715"><span class="section-number-3">15.7</span> Unfill</h3>
<div class="outline-text-3" id="text-15-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">unfill</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)

  (define-key global-map <span style="color: #7fffd4; font-style: italic;">"\M-Q"</span> 'unfill-paragraph)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6a86ae6" class="outline-2">
<h2 id="org6a86ae6"><span class="section-number-2">16</span> eshell</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a50e5a" class="outline-2">
<h2 id="org7a50e5a"><span class="section-number-2">17</span> Music</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">simple-mpc</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)

(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"&lt;f6&gt;"</span>) 'simple-mpc)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ffa9c1" class="outline-2">
<h2 id="org5ffa9c1"><span class="section-number-2">18</span> Pass</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff; font-weight: bold;">use-package</span> <span style="color: #7fffd4; font-weight: bold;">pass</span>
  <span style="color: #b0c4de; font-weight: bold;">:ensure</span> t)

(global-set-key (kbd <span style="color: #7fffd4; font-style: italic;">"&lt;f7&gt;"</span>) 'pass)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Giovanni Calzolari</p>
<p class="date">Created: 2020-10-12 mån 20:45</p>
</div>
</body>
</html>
